include PreBuiltPagesHelper

pages = {}

pages['TopPage'] = <<'EOS'
徳田・村井・楠本・中村・高汐・バンミーター・植原・三次・中澤・武田合同研究プロジェクト(RG)のポータルサイトです。

毎週木曜日の4限(2:45PM~4:15PM)と5限(4:30PM~6:00PM)にι23教室でRG全体授業を行っています。
EOS

pages['WipTerm'] = <<'EOS'
# WIP/TERM
## WIP (Work In Progress)
RGに所属し始めてから2学期目以降の学生は、学期中に取り組んだ内容とそれを踏まえた今後の活動・研究の展望について発表するWIP発表が原則として必須になります。
新規履修者の方は自由参加でWIPの発表ができます。

なお、WIP発表は中間と最終の2回に分けて行われ、そのどちらで発表を行うかを選択することができます。

## TERM
RGで卒業プロジェクトを履修するためには、遅くとも卒業プロジェクト履修前の学期中にTERM発表を行い、教員からの合格をもらう必要があります。

TERM発表ではWIP発表と異なり、中間発表で研究テーマ・評価方法・スケジュールについて話した上で、最終発表では実際に研究として取り組んだ結果の発表を求められます。
EOS

pages['Thesis'] = <<'EOS'
# 卒論 / Graduate thesis
RGの教員の卒業プロジェクトを履修する場合は前学期までにTERMプロジェクトで合格をもらう必要があります。

## 卒業プロジェクト1 / Graduation Project 1

学期中に論文テーマとスケジュールについて話す所信表明を行い、学期末に英語でポスター発表を行う必要があります。

## 卒業プロジェクト2 / Graduation Project 2

学事の規定する期限までに論文を提出して受理され、学期末に最終成果の発表を行って合格をもらう必要があります。
EOS

pages[term_name] = <<"EOS"
# #{term_name}授業情報

| 回 | 日付 | 授業内容 |
|:---:|:---:|:---:|
EOS

Meeting.order(:start_at).each.with_index(1) do |meeting, i|
  main = meeting.presentations.first
  content = main ? main.title : '未定'
  pages[term_name] += "| #{i} | #{meeting.start_at.strftime('%Y/%m/%d')} | #{content} |\n"
end

today = Time.zone.now
if term_name[-1, 1] == 's'
  mid_term = "#{today.year}年6月上旬"
  term = "#{today.year}年7月下旬"
else
  mid_term = "#{today.year}年12月上旬"
  term = "#{today.year + 1}年2月上旬"
end

pages["#{term_name}/WipTerm"] = <<"EOS"
# #{term_name}予定

| | 日付 | 時間 | 場所 |
|:---:|:---:|:---:|:---:|
| 徳田研 WIP/TERM 中間発表 | #{mid_term} | 未定 | 未定 |
| 村井研 WIP/TERM 中間発表 | #{mid_term} | 未定 | 未定 |
| 徳田研 WIP/TERM 最終発表 | #{term} | 未定 | 未定 |
| 村井研 WIP/TERM 中間発表 | #{term} | 未定 | 未定 |

### WIP

| 形式 | 発表時間 | 質疑応答時間 | 使用言語 |
|:---:|:---:|:---:|:---:|
| ・スライドを使用したプレゼンテーション<br>・発表内容を論文形式にまとめた予稿 | 7分間 | 3分間 | 日本語または英語 |

### TERM

| 形式 | 発表時間 | 質疑応答時間 | 使用言語 |
|:---:|:---:|:---:|:---:|
| スライドを使用したプレゼンテーション<br>・発表内容を論文形式にまとめた予稿 | 10分間 | 5分間 | 日本語または英語 |
EOS

pages["#{term_name}/Thesis"] = <<"EOS"
# #{term_name}予定

## 卒業プロジェクト1

| | 日付 | 時間 | 場所 |
|:---:|:---:|:---:|:---:|
| 所信表明 | #{mid_term} | 未定 | ι23 |
| 徳田研中間ポスター発表 | #{term} | 未定 | 未定 |
| 村井研中間ポスター発表 | #{term} | 未定 | 未定 |

### 所信表明

卒論中間ポスター発表に向けて決定した研究テーマ及び研究計画・論文執筆計画を発表していただきます。

| 形式 | 発表時間 | 質疑応答時間 | 使用言語 |
|:---:|:---:|:---:|:---:|
| スライドを使用したプレゼンテーション | 3分間 | 2分間 | 英語のみ |

### 中間ポスター発表

卒論の途中経過として現時点での進捗状況及び研究計画・論文執筆計画を発表していただきます。

| 形式 | セッション時間 | 使用言語 |
|:---:|:---:|:---:|
| ポスターセッション | 未定 | 英語のみ |

## 卒業プロジェクト2

| | 日付 | 時間 | 場所 |
|:---:|:---:|:---:|:---:|
| 仮綴じ (Web, 紙) | #{mid_term} | 未定 | 未定 |
| 本綴じ (Web) | #{term} | 未定 | 未定 |
| 本綴じ (紙) | #{term} | 未定 | 未定 |
| 村井研最終発表 | #{term} | 未定 | 未定 |
| 徳田研最終発表 | #{term} | 未定 | 未定 |

### 仮綴じ

| 使用言語 | 提出形式 |
|:---:|:---:|
| 日本語または英語 | ・印刷しバインダに綴じたものを**3部**作成し提出場所へ持参<br>・卒論係の指定するアップローダにてデータをアップロード |

※ アップローダーは近日公開予定です

### 本綴じ

| 使用言語 | 提出形式 | 要件 |
|:---:|:---:|:---:|
| 日本語または英語 | ・印刷しバインダに綴じたものを**2部**作成し提出場所へ持参<br>・卒論係の指定するアップローダにてデータをアップロード | ・バインダーに表紙と背表紙が貼ってあるか<br>・親のコメントが入ってるか<br>・コメント用紙に親の直筆サインもしくは印鑑が入っているか<br>・親の直筆サインが入ったコメント用紙をスキャンしてwebにアップロードしてあるか |

※ アップローダーおよび表紙・背表紙・コメント用紙のテンプレートは近日公開予定です

### 最終発表

| 形式 | 発表時間 | 質疑応答時間 | 使用言語 |
|:---:|:---:|:---:|:---:|
| スライドを使用したプレゼンテーション | 20分間 | 10分間 | 日本語または英語 |
EOS

pages['Sandbox'] = <<'EOS'
ここは自由にテストできる場所です:smiley:
EOS

comments = %w(素晴らしいページだ！ 情報の更新をお願いします:bow: わかりやすい情報提供感謝:heart_eyes:)

users = User.all
pages.each do |name, content|
  page = Page.create!(
    path: name,
    title: name,
    content: content,
    user: users.sample
  )

  comments.sample(rand(3)).each do |comment|
    page.comments.create!(user: users.sample, content: comment)
  end
end
